{
  "about": {
    "greeting_message": "Hii there,",
    "greeting_intro": "I am",
    "about_description": "I’m an Estimator with a passion for turning ideas into practical, buildable solutions—specifically in the world of Pre-Engineered Buildings. For me, it’s not just about numbers—it’s about contributing to smart, well-executed builds that stand the test of time.",
    "urls": [
      {
        "label": "Linkedin",
        "icon": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/linkedin.png",
        "url": "https://www.linkedin.com/in/gifto-baby-0abaa218b"
      }
    ]
  },
  "profile": {
    "name": "Gifto Baby",
    "short_name": "Gifto",
    "profile_image": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/profile_image.webp",
    "dob": "1997-01-06T11:34:42.000",
    "my_tag_line": "Creating Design Constructible.",
    "what_am_i": "As a precision-focused Estimator specializing in Pre-Engineered Buildings (PEBs), I bring a strong understanding of steel structures, connection detailing, and material optimization to every project. I transform design concepts into accurate, cost-effective estimates that support efficient planning, seamless execution, and value-driven solutions across industrial, commercial, and institutional PEB developments.",
    "timeline": [
      {
        "role_or_degree": "Estimator",
        "institution_name": "Canadian Metal Buildings, Stoney Creek, Ontario, Canada",
        "description": "Prepares accurate cost estimates by developing preliminary designs for Pre-Engineered Buildings (PEBs).",
        "from_date": "2024-05-13T00:00:00.000",
        "to_date": "",
        "icon_url": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/job.png"
      },
      {
        "role_or_degree": "Structural Steel Detailer",
        "institution_name": "CDN Buildings, Delhi, Ontario, Canada",
        "description": "Translates structural designs into precise shop drawings for fabrication and erection of steel components.",
        "from_date": "2023-06-26T00:00:00.000",
        "to_date": "2024-04-19T00:00:00.000",
        "icon_url": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/job.png"
      },
      {
        "role_or_degree": "Structural Steel Management and Detailing",
        "institution_name": "Conestoga College, Cambridge, Ontario, Canada",
        "description": "Equipped with the skills and knowledge necessary for the Estimation, detailing, supply, fabrication, and installation of steel structures, as well as the ability to manage and coordinate projects.",
        "from_date": "2022-01-10T00:00:00.000",
        "to_date": "2023-04-26T00:00:00.00",
        "icon_url": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/studies.png"
      },
      {
        "role_or_degree": "Programmer Analyst",
        "institution_name": "Cognizant Technology Solutions",
        "description": "Designs, develops, and analyzes software solutions to meet business needs.",
        "from_date": "2020-08-31T00:00:00.000",
        "to_date": "2021-12-03T00:00:00.000",
        "icon_url": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/job.png"
      },
      {
        "role_or_degree": "Bachelor's Degree, Civil Engineering",
        "institution_name": "APJ Abdul Kalam Technological University (KTU), Thiruvananthapuram",
        "description": "A comprehensive program focused on the design, construction, and maintenance of infrastructure projects, including buildings, roads, bridges, and water systems. It combines engineering principles with practical skills in structural analysis, materials, geotechnics, and project management.",
        "from_date": "2016-07-01T00:00:00.000",
        "to_date": "2020-09-01T00:00:00.000",
        "icon_url": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/studies.png"
      },
      {
        "role_or_degree": "Grade 12",
        "institution_name": "Carmel HSS Chalakudy, Thrissur, Kerala, India",
        "description": "Learned advanced level maths and science",
        "from_date": "2013-06-13T00:00:00.000",
        "to_date": "2015-05-15T00:00:00.00",
        "icon_url": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/studies.png"
      },
      {
        "role_or_degree": "Grade 10",
        "institution_name": "Carmel HSS Chalakudy, Thrissur, Kerala, India",
        "description": "Learned maths, science, history and gained fundamental education",
        "from_date": "2012-05-07T00:00:00.000",
        "to_date": "2013-03-24T00:00:00.00",
        "icon_url": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/studies.png"
      }
    ]
  },
  "projects": [
    {
      "name": "Canadian Metal Buildings Inc.",
      "role": "Estimator",
      "description": "As an Estimator, I am responsible for preparing accurate and cost-effective estimates for pre-engineered buildings by combining structural design expertise with in-depth cost analysis. My role involves creating preliminary designs and drawings, conducting insulation calculations, and analyzing structures in accordance with the latest US and Canadian building codes. I work closely with engineers, project managers, and detailers to ensure the accuracy and feasibility of designs and cost estimates. My tasks include preparing quotes for various building components, including insulated metal panels (IMPs) and different cladding systems, by sourcing competitive quotes from suppliers. I also generate and manage change orders for ongoing projects as design or scope evolves. Utilizing specialized estimating software, I calculate the expected costs for materials, manpower, and equipment, based on architectural drawings and project specifications. I ensure that spreadsheets and take-off forms are clear, well-formatted, and easy to interpret by stakeholders. Throughout the process, I maintain effective communication with clients, vendors, and internal teams, ensuring that all estimates are comprehensive and aligned with project requirements. A key objective of my role is to use efficient structural design methods to reduce structural weight and overall project costs, without compromising quality or safety.",
      "from_date": "2024-05-13T00:00:00.000",
      "to_date": "",
      "technologies": [
        {
          "label": "MBS",
          "icon": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/mbs.png"
        },
        {
          "label": "Bluebeam",
          "icon": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/bluebeam.png"
        },
        {
          "label": "Excel",
          "icon": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/excel.png"
        },
        {
          "label": "Google Sheets",
          "icon": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/sheets.png"
        }
      ],
      "urls": []
    },
    {
      "name": "CDN Buildings",
      "role": "Structural Steel Detailer",
      "description": "In my previous role as a Detailer, I was responsible for creating precise engineering, design, and shop drawings from permit drawings using CAD software and Advance Steel. I worked closely with engineers and project teams to translate design intent into detailed fabrication documents, while also interpreting blueprints and applying my knowledge of metal fabrication processes. I participated in project meetings and site visits to support construction reviews, and prepared structural details and written reports under the direction of team leads. My role also involved generating bills of materials and packing lists for fabrication and logistics, as well as implementing change orders by updating drawings and designs accordingly. Throughout each project, I ensured compliance with industry standards and maintained clear, organized records of all revisions and documentation.",
      "from_date": "2023-06-26T00:00:00.000",
      "to_date": "2024-04-19T00:00:00.000",
      "technologies": [
        {
          "label": "AutoCad",
          "icon": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/autocad.png"
        },
        {
          "label": "Revit",
          "icon": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/revit.png"
        },
        {
          "label": "Advance Steel",
          "icon": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/advancesteel.png"
        },
        {
          "label": "Excel",
          "icon": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/excel.png"
        }
      ],
      "urls": []
    },
    {
      "name": "Capstone Project - Conestoga College",
      "role": "Project Manager",
      "description": "As part of our final-year capstone project, my team was responsible for the structural steel supply and installation for Division 1 of the 540 Bingemans Centre Drive project. The scope included preparing bid documents, developing a Gantt chart for project scheduling, and drafting RFQs and purchase orders for subcontractors. We collaboratively developed a detailed 3D model of the structure using Trimble Tekla, interpreted architectural and structural drawings, and raised RFIs to clarify design details. Our team also designed steel connections and produced accurate assembly drawings, erection drawings, anchor bolt plans, and shop drawings for columns and beams. We utilized tools such as Tekla Structures and Bluebeam to ensure clarity and precision in all deliverables. I'm proud to have been part of a dedicated team whose efforts were recognized as the best project in our batch. Our assembly and erection drawings were acknowledged by both instructors and industry professionals for their quality and impact. Special thanks to Charlie Jenks for his continuous guidance and support throughout the project, and for helping us participate in TECH SHOWCASE – April 2023, an event highlighting the top final-year projects from Conestoga College’s School of Engineering and Technology. This experience not only strengthened my technical and modeling skills but also reinforced the value of effective teamwork and real-world project coordination.",
      "from_date": "2023-01-05T00:00:00.000",
      "to_date": "2023-04-15T00:00:00.000",
      "technologies": [
        {
          "label": "Tekla",
          "icon": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/tekla.png"
        },
        {
          "label": "Excel",
          "icon": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/excel.png"
        },
        {
          "label": "AutoCad",
          "icon": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/autocad.png"
        },
        {
          "label": "Revit",
          "icon": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/icons/revit.png"
        }
      ],
      "urls": []
    }
  ],
  "contact": {
    "email_id": "babygifto73@gmail.com",
    "phone": "+1 (226) 388-1132",
    "address": "Hamilton, Ontario",
    "postal_code": "Canada"
  },
  "resume_url": "https://raw.githubusercontent.com/Giftobaby/portfolio/main/files/gifto_baby_resume.pdf"
}